select abc.[Начало периода], [Окончание периода], abc.[Код товара], abc.[Категория, ед.], abc.[Категория, сумма] 
  from dbo.ABC_Товар abc

select abc.[Начало периода], abc.[Окончание периода], abc.[Код филиала], f.[Филиал], abc.[Код товара], abc.[Категория, ед.], abc.[Категория, сумма] 
  from dbo.ABC_Филиал_Товар abc join dbo.[Филиал] f on abc.[Код филиала] = f.[Код филиала]

SELECT [Дата]
      ,abc.[Код филиала]
      ,f.[Филиал]
      ,[Отдел]
      ,[Группа]
      ,[Подгруппа]
      ,[Код товара]
      ,[Товар]
      ,[PromoFail_count]
      ,[PromoFail_amount]
      ,[Deficit_count]
      ,[Ед. изм. сокращенная]
      ,[Кол-во продаж розница]
      ,[Количество продажи по акции]
      ,[Сумма продаж розница с НДС]
      ,[Сумма продаж по акции]
      ,[Остаток на конец (ед)]
      ,[Остаток на конец (тг)]
  FROM [ABC_Data].[dbo].[ABC_Data] abc join dbo.[Филиал] f on abc.[Код филиала] = f.[Код филиала]


 -- загрузка прогноза в таблицы 
SELECT [Начало периода], (select top(1) [Товар] from [dbo].[ABC_Data] dat where dat.[Код товара]=abc.[Код товара])
      ,[Код товара]
      ,[Категория, ед.]
      ,[Категория, сумма]
      ,[Категория, ед.(прогноз)]
      ,[Категория, сумма(прогноз]
  FROM [dbo].[ABC_Товар] abc
  where [Категория, ед.] <> [Категория, ед.(прогноз)]  or [Категория, сумма] <> [Категория, сумма(прогноз]
/*
update [dbo].[ABC_Товар] set [Категория, ед.(прогноз)] = cast(cast (src.[Категория, ед ] as float) as tinyint),
							 [Категория, сумма(прогноз]= cast(cast(src.[Категория, сумма] as float) as tinyint)
from [dbo].[ABC_Товар] dst join [dbo].[ABC_Товар_from_Python] src
		on src.[Код товара] = dst.[Код товара]

SELECT [Код товара],
      cast(cast ([Категория, ед ] as float) as tinyint) as [Категория, ед ],
      cast(cast([Категория, сумма] as float) as tinyint) as [Категория, сумма]
  FROM [dbo].[ABC_Товар_from_Python]

*/